########################################################################
# Technology
########################################################################

source scripts/common.tcl

########################################################################
# Read Design
########################################################################

read_db db/07_post_cts.db

########################################################################
# Constraints
########################################################################

read_sdc constraints/constraints.sdc

########################################################################
# RC Estimation
########################################################################

set_wire_rc -signal -layer met3
set_wire_rc -clock  -layer met5

########################################################################
# Global Routing
########################################################################

global_route -guide_file results/global_route.guide -congestion_iterations 100 -critical_nets_percentage 30 -verbose
########################################################################
# RC Extraction from Global Routing
########################################################################

estimate_parasitics -global_routing

########################################################################
# Reports
########################################################################

puts "\n================ GLOBAL ROUTING ================\n"

report_checks -path_delay max -format summary
report_checks -path_delay min -format summary

report_clock_skew
report_design_area

########################################################################
# Save
########################################################################

write_db db/08_global_route.db
write_def def/08_global_route.def
